CSI API ETABS v1

# cSapModelDesignSteel Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignSteel DesignSteel { get; }

    ReadOnly Property DesignSteel As cDesignSteel
    	Get

    Dim instance As cSapModel
    Dim value As cDesignSteel

    value = instance.DesignSteel

    property cDesignSteel^ DesignSteel {
    	cDesignSteel^ get ();
    }

    abstract DesignSteel : cDesignSteel with get

#### Property Value

Type: cDesignSteel

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com